000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/УдалениеРекламныхМатериалов/УдалениеРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалениеРекламныхМатериалов</name>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Док</name>
      <type>
        <types>DocumentRef.РаспоряжениеНаПриемку</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.ПоставщикиРекламныхМатериалов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РекламныеМатериалыКПриемке/РекламныеМатериалыКПриемке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РекламныеМатериалыКПриемке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРаспоряжение</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/УдалениеРекламныхМатериалов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Объект.ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение КАК Док,
		|	РекламныеМатериалыКПриемкеОстатки.Магазин КАК Магазин,
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток КАК Количество,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.Поставщик КАК Поставщик,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаС КАК ДатаС,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо КАК ДатаПо
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКПриемке.Остатки КАК РекламныеМатериалыКПриемкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо < &ТекДата
		|	И НЕ РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо = ДАТАВРЕМЯ(1, 1, 1)
		|	И РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПо,
		|	Док";
	
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ТЧ.Загрузить(РезультатЗапроса.Выгрузить());
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	Для Каждого Строка из Объект.ТЧ цикл
		Если Строка.Выбран тогда 
			УдалитьСтрокуТЧ(Строка.Док,Строка.РекламныйМатериал,Строка.РекламнаяПлоскость);
		КонецЕсли;
	КонецЦикла;
	Объект.ТЧ.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуТЧ(Док,РекламныйМатериал,РекламнаяПлоскость)
	Записывать = Ложь;
	ТекДок = Док.ПолучитьОбъект();
	ПараметрыОтбора = Новый Структура;
    ТабличнаяЧастьДок = ТекДок.РекламныеМатериалы; 	
	ПараметрыОтбора.Вставить("РекламныйМатериал", РекламныйМатериал);
	ПараметрыОтбора.Вставить("РекламнаяПлоскость", РекламнаяПлоскость);
	СтрокиТЧ =  ТабличнаяЧастьДок.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаРМ Из СтрокиТЧ Цикл
		ТабличнаяЧастьДок.Удалить(СтрокаРМ);
		Записывать = Истина;
	КонецЦикла;
	Если Записывать тогда 
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		 	Сообщить("При записи документа "+Док+ " произошла ошибка!" );
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервере();
КонецПроцедуры
